{
    "github": "https://github.com/whoanuragverma/word-predictor",
    "title": "Word Predictor",
    "imgPath": "/wordpredictor.jpg",
    "link": "/projects/wordpredictor",
    "para1": "Have you ever wanted to type a really long doc on a computer? If yes you might have found out that it is a hectic job without any suggestions about what should the next word be. Word predictor is a browser based text-editor that predicts the next possible word from what you're typing.",
    "para2": "Word predictor is able to predict the next word within a few milliseconds from a huge dictionary of 400K words. The webapp also includes a WYSIWYG text-editor with which you can directly print and proof all your documents.",
    "view": "view project",
    "tech": ["Python", "Flask", "JavaScript", "Bootstrap"],
    "longDesc": "To build a solution we used a trie data structure to basically search next most possible word from a pool of 400K words and those suggestions are then passed on to a web based API so that it can be consumed by the end user in browser itself. To keep things fast and moving we used C++ to design the word search and then use Inter-process communication (IPC) to connect it with a flask based backend. This flask backend also serves an fully functional webapp to the browser to allow people to edit docs on the fly.",
    "keywords": [
        "Trie",
        "Word Prediction",
        "Text Editor",
        "Webapp",
        "WYSIWYG Editor"
    ],
    "partner": "4 teammates",
    "problem": "Typing a long doc on a PC is no joke, with the habit of using suggestion on smartphones people find it really difficult to type a long document without any suggestions. Altough there are some apps that make these suggestions available, users don't like to install something new everytime they want to do something.",
    "shortDesc": "Want to use text suggestions while writing a doc on a PC? Well yes you can!",
    "type": "CSE2003 - Data Structures and Algorithms<br/><b>Instructor:</b> Dr. Gayathri P"
}
