{
    "demo": "http://meschain.herokuapp.com/",
    "github": "https://github.com/whoanuragverma/meschain",
    "title": "मेसचेन",
    "imgPath": "/meschain.jpg",
    "link": "/projects/meschain",
    "para1": "मेसचेन का उद्देश्य मैसेजिंग ऐप की प्रमुख समस्या को हल करना है, गोपनीयता। यह ब्लॉकचैन नेटवर्क के शीर्ष पर डिज़ाइन किया गया है जो कि XSalsa20 आधारित सार्वजनिक-कुंजी प्रमाणित एन्क्रिप्शन वाले उपयोगकर्ताओं द्वारा संचालित है।",
    "para2": "सब कुछ डिफ़ॉल्ट रूप से एन्क्रिप्ट किया गया है और उपयोगकर्ता स्तर तक विकेंद्रीकृत है। केवल एक ब्राउज़र के साथ कोई भी इस निस्वार्थ संदेशवाहक का उपयोग कर सकता है।",
    "view": "प्रोजेक्ट देखें",
    "keywords": [
        "ब्लॉकचेन",
        "मैसेंजर",
        "विकेन्द्रीकृत",
        "SHA256",
        "एथेरियम",
        "एंड-टू-एंड एन्क्रिप्शन",
        "क्रिप्टो"
    ],
    "longDesc": "इस परियोजना में मैंने उपयोगकर्ता के ब्राउज़र में एक ब्लॉकचेन बनाने और बनाए रखने के लिए नवीनतम वेब तकनीक का उपयोग किया है और साथ ही साथ नेटवर्क पर विभिन्न नोड्स में कनेक्ट करने और चलाने के लिए पीयर-टू-पीयर कनेक्शन स्टार्टी का उपयोग किया है, बिना किसी केंद्रीय पर भरोसा किए। सर्वर। सब कुछ एक अलग थ्रेड पर होता है जो ऐप पर उपयोगकर्ता प्रयोगकर्ता को बाधित किए बिना एक ही थ्रेड पर खनन एल्गोरिदम चलाता है। एक बार संदेश भेजे जाने के बाद सभी नोड्स उस नोड को ब्लॉकचैन में जोड़ने के लिए प्रतिस्पर्धा करते हैं, एक बार ऐसा करने के बाद नया नोड प्रकाशित हो जाता है और प्राप्तकर्ता ब्लॉकचैन से नवीनतम संदेश प्रदर्शित करता है।",
    "partner": "एकल परियोजना",
    "tech": ["React", "TypeScript", "Peer.js", "Express", "Rimble-UI"],
    "type": "सीएसई1003 - ब्लॉकचेन और क्रिप्टोकरेंसी<br/><b>प्रशिक्षक:</b> डॉ. बूमिनाथन पी",
    "problem": "लगभग सभी मौजूदा आईएम एक केंद्रीकृत सेवा का उपयोग करते हैं जो इसे उपयोगकर्ता की गोपनीयता पर कठिन बनाता है और वास्तव में यह जानने का कोई तरीका नहीं है कि वे सेवा प्रदाता इन आईएम से एकत्र किए गए डेटा का उपयोग कैसे कर रहे हैं।",
    "shortDesc": "अधिक निजी इंटरनेट बनाने के लिए आधुनिक वेब मानकों का उपयोग करते हुए, मेशचैन केंद्रीय स्तर से लेकर ब्लॉकचेन तक पूरे टेक्स्टिंग अनुभव को ले जाता है।"
}
