{
    "title": "Meschain",
    "imgPath": "/meschain.jpg",
    "link": "/projects/meschain",
    "para1": "Meschain का उद्देश्य मैसेजिंग ऐप्स, गोपनीयता के साथ प्रमुख समस्या को हल करना है। यह एक्ससाल्सा 20 आधारित सार्वजनिक-कुंजी प्रमाणित एन्क्रिप्शन के साथ उपयोगकर्ताओं द्वारा संचालित ब्लॉकचेन नेटवर्क के शीर्ष पर डिज़ाइन किया गया है।",
    "para2": "सब कुछ डिफ़ॉल्ट रूप से एन्क्रिप्ट किया जाता है और उपयोगकर्ता स्तर पर विकेंद्रीकृत होता है। केवल एक ब्राउज़र के साथ कोई भी इस निस्वार्थ संदेशवाहक का उपयोग कर सकता है।",
    "view": "प्रोजेक्ट देखें",
    "type": "सीएसई 1006 - ब्लॉकचेन और क्रिप्टोक्यूरेंसी<br/><b>प्रशिक्षक:</b> डॉ।",
    "tech": [
        "प्रतिक्रिया करना",
        "टंकित प्रति",
        "पीयर.js",
        "एक्सप्रेस",
        "Rimble-UI"
    ],
    "shortDesc": "मेस्चेन पूरे टेक्स्टिंग अनुभव को केंद्रीय स्तर से ब्लॉकचेन तक ले जाता है, एक अधिक निजी इंटरनेट बनाने के लिए आधुनिक वेब मानकों का उपयोग करता है।",
    "longDesc": "इस परियोजना में मैंने उपयोगकर्ता के ब्राउज़र में ब्लॉकचेन बनाने और बनाए रखने के लिए नवीनतम वेब तकनीक का उपयोग किया है और साथ ही साथ केंद्रीय सर्वर पर भरोसा किए बिना नेटवर्क पर विभिन्न नोड्स में कॉन्सेनसस को कनेक्ट करने और चलाने के लिए पीयर-टू-पीयर कनेक्शन स्टार्टीजी का उपयोग किया है। सब कुछ एक अलग थ्रेड पर होता है जो ऐप पर उपयोगकर्ता के अनुभव को बाधित किए बिना एक ही थ्रेड पर माइनिंग एल्गोरिदम चलाता है। एक बार संदेश भेजे जाने के बाद सभी नोड्स ब्लॉकचेन में उस नोड को जोड़ने के लिए प्रतिस्पर्धा करते हैं, एक बार ऐसा करने के बाद नया नोड प्रकाशित होता है और रिसीवर ब्लॉकचेन से नवीनतम संदेश प्रदर्शित करता है।",
    "problem": "लगभग सभी मौजूदा आईएम एक केंद्रीकृत सेवा का उपयोग करते हैं जो इसे उपयोगकर्ता की गोपनीयता पर अलग बनाता है और वास्तव में यह जानने का कोई तरीका नहीं है कि वे सेवा प्रदाता इन आईएम से एकत्र किए गए डेटा का उपयोग कैसे कर रहे हैं।",
    "partner": "सोलो प्रोजेक्ट",
    "github": "https://github.com/whoanuragverma/meschain",
    "demo": "http://meschain.herokuapp.com/",
    "keywords": [
        "Blockchain",
        "दूत",
        "विकेन्द्रीकृत",
        "SHA256",
        "Ethereum",
        "एंड-टू-एंड एन्क्रिप्शन",
        "क्रिप्टो",
        "स्टाइल किए गए घटक"
    ]
}
