{
    "github": "https://github.com/whoanuragverma/word-predictor",
    "title": "वर्ड प्रेडिक्टर",
    "imgPath": "/wordpredictor.jpg",
    "link": "/projects/wordpredictor",
    "para1": "क्या आप कभी कंप्यूटर पर वास्तव में लंबा डॉक्टर टाइप करना चाहते हैं? यदि हां, तो आपको पता चल सकता है कि यह एक व्यस्त काम है, बिना किसी सुझाव के कि अगला शब्द क्या होना चाहिए। वर्ड प्रेडिक्टर एक ब्राउज़र आधारित टेक्स्ट-एडिटर है जो आपके द्वारा टाइप किए जा रहे अगले संभावित शब्द की भविष्यवाणी करता है।",
    "para2": "वर्ड प्रेडिक्टर 400K शब्दों के विशाल शब्दकोश से कुछ मिलीसेकंड के भीतर अगले शब्द की भविष्यवाणी करने में सक्षम है। वेबऐप में एक WYSIWYG टेक्स्ट-एडिटर भी शामिल है जिसके साथ आप सीधे अपने सभी दस्तावेजों को प्रिंट और प्रमाणित कर सकते हैं।",
    "view": "परियोजना देखें",
    "tech": ["अजगर", "कुप्पी", "जावास्क्रिप्ट", "बूटस्ट्रैप"],
    "longDesc": "एक समाधान बनाने के लिए हमने मूल रूप से 400K शब्दों के पूल से अगले सबसे संभव शब्द को खोजने के लिए एक ट्राई डेटा संरचना का उपयोग किया और उन सुझावों को फिर एक वेब आधारित एपीआई पर पारित किया जाता है ताकि ब्राउज़र में अंतिम उपयोगकर्ता द्वारा इसका उपभोग किया जा सके। चीजों को तेज रखने और आगे बढ़ने के लिए हमने खोज शब्द को डिजाइन करने के लिए सी ++ का उपयोग किया और फिर इसे फ्लास्क आधारित बैकएंड से जोड़ने के लिए इंटर-प्रोसेस कम्युनिकेशन (आईपीसी) का उपयोग किया। यह फ्लास्क बैकएंड ब्राउज़र के लिए एक पूरी तरह कार्यात्मक वेबऐप भी प्रदान करता है ताकि लोग फ्लाई पर डॉक्स को संपादित कर सकें।",
    "keywords": [
        "Trie",
        "Word Prediction",
        "पाठ संपादक",
        "वेबऐप",
        "WYSIWYG संपादक"
    ],
    "partner": "4 टीम के साथी",
    "problem": "पीसी पर एक लंबा डॉक्टर टाइप करना कोई मजाक नहीं है, स्मार्टफोन पर सुझाव का उपयोग करने की आदत के साथ लोगों को बिना किसी सुझाव के एक लंबा दस्तावेज़ टाइप करना वास्तव में मुश्किल लगता है। कुछ ऐप हैं जो इन सुझावों को उपलब्ध कराते हैं, उपयोगकर्ता हर बार कुछ नया इंस्टॉल करना पसंद नहीं करते हैं जब वे कुछ करना चाहते हैं।",
    "shortDesc": "पीसी पर डॉक्टर लिखते समय पाठ सुझावों का उपयोग करना चाहते हैं? हाँ, आप कर सकते हैं!",
    "type": "सीएसई 2003 - डेटा संरचनाएं और एल्गोरिदम<br/><b>प्रशिक्षक:</b> डॉ गायत्री पी"
}
